sangseu/SW1800_MotorFOCDriver/CSL/CMSIS/DeviceSupport/SWM1800.h
#define PORTG_PORTD_PIN0_Pos		0
#define PORTG_PORTD_PIN0_Msk		(0x03 << PORTG_PORTD_PIN0_Pos)
#define PORTG_PORTD_PIN1_Pos		2
#define PORTG_PORTD_PIN1_Msk		(0x03 << PORTG_PORTD_PIN1_Pos)
#define PORTG_PORTD_PIN2_Pos		4
#define PORTG_PORTD_PIN2_Msk		(0x03 << PORTG_PORTD_PIN2_Pos)
#define PORTG_PORTD_PIN3_Pos		6
#define PORTG_PORTD_PIN3_Msk		(0x03 << PORTG_PORTD_PIN3_Pos)
#define PORTG_PORTD_PIN4_Pos		8
#define PORTG_PORTD_PIN4_Msk		(0x03 << PORTG_PORTD_PIN4_Pos)
#define PORTG_PORTD_PIN5_Pos		10
#define PORTG_PORTD_PIN5_Msk		(0x03 << PORTG_PORTD_PIN5_Pos)
#define PORTG_PORTD_PIN6_Pos		12
#define PORTG_PORTD_PIN6_Msk		(0x03 << PORTG_PORTD_PIN6_Pos)
#define PORTG_PORTD_PIN7_Pos		14
#define PORTG_PORTD_PIN7_Msk		(0x03 << PORTG_PORTD_PIN7_Pos)

#define PORTG_PORTE_PIN0_Pos		0
#define PORTG_PORTE_PIN0_Msk		(0x03 << PORTG_PORTE_PIN0_Pos)
#define PORTG_PORTE_PIN1_Pos		2
#define PORTG_PORTE_PIN1_Msk		(0x03 << PORTG_PORTE_PIN1_Pos)
#define PORTG_PORTE_PIN2_Pos		4
#define PORTG_PORTE_PIN2_Msk		(0x03 << PORTG_PORTE_PIN2_Pos)
#define PORTG_PORTE_PIN3_Pos		6
#define PORTG_PORTE_PIN3_Msk		(0x03 << PORTG_PORTE_PIN3_Pos)
#define PORTG_PORTE_PIN4_Pos		8
#define PORTG_PORTE_PIN4_Msk		(0x03 << PORTG_PORTE_PIN4_Pos)
#define PORTG_PORTE_PIN5_Pos		10
#define PORTG_PORTE_PIN5_Msk		(0x03 << PORTG_PORTE_PIN5_Pos)
#define PORTG_PORTE_PIN6_Pos		12
#define PORTG_PORTE_PIN6_Msk		(0x03 << PORTG_PORTE_PIN6_Pos)
#define PORTG_PORTE_PIN7_Pos		14
#define PORTG_PORTE_PIN7_Msk		(0x03 << PORTG_PORTE_PIN7_Pos)




typedef struct {
	__IO uint32_t FUNMUX0;				  //当PORTG->PORTx[2n+2:2n] == PORTx_PINn_FUNMUX时，PORTx_PINn引脚的功能由此寄存器位设定

	__IO uint32_t FUNMUX1;
	__IO uint32_t FUNMUX2;

		 uint32_t RESERVED[61];

	__IO uint32_t PULLU;                    //PULLU[n]为 PINn引脚 上拉电阻使能位： 1 上拉电阻使能	0 上拉电阻禁止

		 uint32_t RESERVED2[63];

	__IO uint32_t PULLD;                    //PULLD[n]为 PINn引脚 下拉电阻使能位： 1 下拉电阻使能	0 下拉电阻禁止

		 uint32_t RESERVED3[63];

	__IO uint32_t OPEND;                    //OPEND[n]为 PINn引脚 开漏使能位： 1 开漏使能	0 开漏禁止

		 uint32_t RESERVED4[127];

	__IO uint32_t INEN;                     //INEN[n] 为 PINn引脚 输入使能位： 1 输入使能	0 输入禁止
} PORT_TypeDef;


#define PORT_FUNMUX0_PIN0_Pos		0		//当PORTG->PORTx[2n+2:2n] == PORTx_PINn_FUNMUX时，PORTx_PINn引脚的功能由此寄存器位设定，其可取值见上面：
#define PORT_FUNMUX0_PIN0_Msk		(0x1F << PORT_FUNMUX0_PIN0_Pos)
#define PORT_FUNMUX0_PIN1_Pos		5
#define PORT_FUNMUX0_PIN1_Msk		(0x1F << PORT_FUNMUX0_PIN1_Pos)
#define PORT_FUNMUX0_PIN2_Pos		10
#define PORT_FUNMUX0_PIN2_Msk		(0x1F << PORT_FUNMUX0_PIN2_Pos)
#define PORT_FUNMUX0_PIN3_Pos		15
#define PORT_FUNMUX0_PIN3_Msk		(0x1F << PORT_FUNMUX0_PIN3_Pos)
#define PORT_FUNMUX0_PIN4_Pos		20
#define PORT_FUNMUX0_PIN4_Msk		(0x1F << PORT_FUNMUX0_PIN4_Pos)
#define PORT_FUNMUX0_PIN5_Pos		25
#define PORT_FUNMUX0_PIN5_Msk		(0x1F << PORT_FUNMUX0_PIN5_Pos)
#define PORT_FUNMUX1_PIN6_Pos		0
#define PORT_FUNMUX1_PIN6_Msk		(0x1F << PORT_FUNMUX1_PIN6_Pos)
#define PORT_FUNMUX1_PIN7_Pos		5
#define PORT_FUNMUX1_PIN7_Msk		(0x1F << PORT_FUNMUX1_PIN7_Pos)
#define PORT_FUNMUX1_PIN8_Pos		10
#define PORT_FUNMUX1_PIN8_Msk		(0x1F << PORT_FUNMUX1_PIN8_Pos)
#define PORT_FUNMUX1_PIN9_Pos		15
#define PORT_FUNMUX1_PIN9_Msk		(0x1F << PORT_FUNMUX1_PIN9_Pos)
#define PORT_FUNMUX1_PIN10_Pos		20
#define PORT_FUNMUX1_PIN10_Msk		(0x1F << PORT_FUNMUX1_PIN10_Pos)
#define PORT_FUNMUX1_PIN11_Pos		25
#define PORT_FUNMUX1_PIN11_Msk		(0x1F << PORT_FUNMUX1_PIN11_Pos)
#define PORT_FUNMUX2_PIN12_Pos		0
#define PORT_FUNMUX2_PIN12_Msk		(0x1F << PORT_FUNMUX2_PIN12_Pos)
#define PORT_FUNMUX2_PIN13_Pos		5
#define PORT_FUNMUX2_PIN13_Msk		(0x1F << PORT_FUNMUX2_PIN13_Pos)
#define PORT_FUNMUX2_PIN14_Pos		10
#define PORT_FUNMUX2_PIN14_Msk		(0x1F << PORT_FUNMUX2_PIN14_Pos)
#define PORT_FUNMUX2_PIN15_Pos		15
#define PORT_FUNMUX2_PIN15_Msk		(0x1F << PORT_FUNMUX2_PIN15_Pos)




typedef struct {
	__IO uint32_t DATA;
#define PIN0    0
#define PIN1    1
#define PIN2    2
#define PIN3    3
#define PIN4    4
#define PIN5    5
#define PIN6    6
#define PIN7    7
#define PIN8    8
#define PIN9    9
#define PIN10   10
#define PIN11   11
#define PIN12   12
#define PIN13   13
#define PIN14   14
#define PIN15   15

	__IO uint32_t DIR;					    //0 输入	1 输出

	__IO uint32_t INTLVLTRG;				//Interrupt Level Trigger  1 电平触发中断	0 边沿触发中断

	__IO uint32_t INTBE;					//Both Edge，当INTLVLTRG设为边沿触发中断时，此位置1表示上升沿和下降沿都触发中断，置0时触发边沿由INTRISEEN选择

	__IO uint32_t INTRISEEN;				//Interrupt Rise Edge Enable   1 上升沿/高电平触发中断	0 下降沿/低电平触发中断

	__IO uint32_t INTEN;					//1 中断使能	0 中断禁止

	__IO uint32_t INTRAWSTAT;			    //中断检测单元是否检测到了触发中断的条件 1 检测到了中断触发条件	0 没有检测到中断触发条件

	__IO uint32_t INTSTAT;				    //INTSTAT.PIN0 = INTRAWSTAT.PIN0 & INTEN.PIN0

	__IO uint32_t INTCLR;				    //写1清除中断标志，只对边沿触发中断有用
} GPIO_TypeDef;




typedef struct {
	__IO uint32_t LDVAL;					//定时器加载值，使能后定时器从此数值开始向下递减计数

	__I  uint32_t CVAL;					 //定时器当前值，LDVAL-CVAL 可计算出计时时长

	__IO uint32_t CTRL;
} TIMR_TypeDef;


#define TIMR_CTRL_EN_Pos			0		//此位赋1导致TIMR从LDVAL开始向下递减计数
#define TIMR_CTRL_EN_Msk			(0x01 << TIMR_CTRL_EN_Pos)
#define TIMR_CTRL_CLKSRC_Pos		1		//时钟源：0 内部系统时钟	1 TIMRx-1的溢出信号驱动TIMRx计数	2 外部引脚脉冲计数
#define TIMR_CTRL_CLKSRC_Msk		(0x03 << TIMR_CTRL_CLKSRC_Pos)




typedef struct {
	__IO uint32_t PCTRL;					//Pulse Control，脉宽测量模块控制寄存器

	__I  uint32_t PCVAL;					//脉宽测量定时器当前值

		 uint32_t RESERVED[2];

	__IO uint32_t IE;

	__IO uint32_t IF;

	__IO uint32_t HALT;
	
	     uint32_t RESERVED2;
	
	__IO uint32_t HALLCR;
	
	__IO uint32_t HALLSR;
	
		 uint32_t RESERVED3[2];
	
	__IO uint32_t HALL_A;					//霍尔信号A触发时刻TIMER0值
	
	__IO uint32_t HALL_B;
	
	__IO uint32_t HALL_C;
} TIMRG_TypeDef;


#define TIMRG_PCTRL_EN_Pos			0		//开始测量脉宽，脉宽内32位计数器从0开始向上计数
#define TIMRG_PCTRL_EN_Msk			(0x01 << TIMRG_PCTRL_EN_Pos)
#define TIMRG_PCTRL_HIGH_Pos		1		//0 测量低电平长度	1 测量高电平长度
#define TIMRG_PCTRL_HIGH_Msk		(0x01 << TIMRG_PCTRL_HIGH_Pos)
#define TIMRG_PCTRL_CLKSRC_Pos		2		//时钟源：0 内部系统时钟	1 脉宽测量模块变成一个计数器，不再具有脉宽测量功能
#define TIMRG_PCTRL_CLKSRC_Msk		(0x01 << TIMRG_PCTRL_CLKSRC_Pos)

#define TIMRG_IE_TIMR0_Pos			0
#define TIMRG_IE_TIMR0_Msk			(0x01 << TIMRG_IE_TIMR0_Pos)
#define TIMRG_IE_TIMR1_Pos			1
#define TIMRG_IE_TIMR1_Msk			(0x01 << TIMRG_IE_TIMR1_Pos)
#define TIMRG_IE_TIMR2_Pos			2
#define TIMRG_IE_TIMR2_Msk			(0x01 << TIMRG_IE_TIMR2_Pos)
#define TIMRG_IE_TIMR3_Pos			3
#define TIMRG_IE_TIMR3_Msk			(0x01 << TIMRG_IE_TIMR3_Pos)
#define TIMRG_IE_PULSE_Pos			16
#define TIMRG_IE_PULSE_Msk			(0x01 << TIMRG_IE_PULSE_Pos)

